SELECT Н_ЛЮДИ.ИМЯ, COUNT(*) 
FROM Н_ЛЮДИ 
WHERE Н_ЛЮДИ.ИД IN (
    SELECT Н_ОБУЧЕНИЯ.ЧЛВК_ИД 
    FROM Н_ОБУЧЕНИЯ 
    WHERE Н_ОБУЧЕНИЯ.ЧЛВК_ИД IN (
        SELECT Н_УЧЕНИКИ.ЧЛВК_ИД 
        FROM Н_УЧЕНИКИ 
        WHERE Н_УЧЕНИКИ.ПЛАН_ИД IN (
            SELECT Н_ПЛАНЫ.ИД 
            FROM Н_ПЛАНЫ 
            WHERE Н_ПЛАНЫ.ФО_ИД = (
                SELECT Н_ФОРМЫ_ОБУЧЕНИЯ.ИД 
                FROM Н_ФОРМЫ_ОБУЧЕНИЯ 
                WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.ИМЯ_В_ИМИН_ПАДЕЖЕ = 'очная'
            )
        )
    )
)
GROUP BY Н_ЛЮДИ.ИМЯ
HAVING COUNT(*) > 50 and Н_ЛЮДИ.ИМЯ in 
    (select Н_ЛЮДИ.ИМЯ from Н_ЛЮДИ where Н_ЛЮДИ.ИД not in 
        (select Н_ОБУЧЕНИЯ.ЧЛВК_ИД from Н_ОБУЧЕНИЯ where Н_ОБУЧЕНИЯ.ЧЛВК_ИД in
            (select Н_УЧЕНИКИ.ЧЛВК_ИД from Н_УЧЕНИКИ)));



select Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, avg(Н_ВЕДОМОСТИ.ОЦЕНКА::integer) from Н_ЛЮДИ LEFT JOIN Н_ВЕДОМОСТИ on Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД where Н_ЛЮДИ.ИД in
    (select Н_ОБУЧЕНИЯ.ЧЛВК_ИД from Н_ОБУЧЕНИЯ where Н_ОБУЧЕНИЯ.ЧЛВК_ИД in 
        (select Н_УЧЕНИКИ.ЧЛВК_ИД from Н_УЧЕНИКИ where (Н_УЧЕНИКИ.ГРУППА::integer = 4100))) 
    and (Н_ВЕДОМОСТИ.ОЦЕНКА >= (select min(Н_ВЕДОМОСТИ.ОЦЕНКА) from Н_ВЕДОМОСТИ where Н_ВЕДОМОСТИ.ЧЛВК_ИД in (select Н_ЛЮДИ.ИД from Н_ЛЮДИ where Н_ЛЮДИ.ИД in 
    (Select Н_ОБУЧЕНИЯ.ЧЛВК_ИД from Н_ОБУЧЕНИЯ where Н_ОБУЧЕНИЯ.ЧЛВК_ИД in 
        (Select Н_УЧЕНИКИ.ИД from Н_УЧЕНИКИ where Н_УЧЕНИКИ.ГРУППА::integer = 1100))))) and (Н_ВЕДОМОСТИ.ОЦЕНКА <> 'зачет') and (Н_ВЕДОМОСТИ.ОЦЕНКА <> 'незач') and (Н_ВЕДОМОСТИ.ОЦЕНКА <> 'неявка')
    and (Н_ВЕДОМОСТИ.ОЦЕНКА <> 'незач') and (Н_ВЕДОМОСТИ.ОЦЕНКА <> 'осв')

    GROUP BY Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО; 



select КОНЕЦ_ПО_ПРИКАЗУ from Н_УЧЕНИКИ where ПРИЗНАК='отчисл' and КОНЕЦ_ПО_ПРИКАЗУ='2012-09-01';

select Н_УЧЕНИКИ.ГРУППА, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, Н_УЧЕНИКИ.П_ПРКОК_ИД from Н_ЛЮДИ LEFT JOIN Н_УЧЕНИКИ on (Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД) where Н_ЛЮДИ.ИД in  
(select Н_ОБУЧЕНИЯ.ЧЛВК_ИД from Н_ОБУЧЕНИЯ where Н_ОБУЧЕНИЯ.ЧЛВК_ИД in 
(select Н_УЧЕНИКИ.ЧЛВК_ИД from Н_УЧЕНИКИ where Н_УЧЕНИКИ.ПЛАН_ИД in 
 (select Н_ПЛАНЫ.ИД from Н_ПЛАНЫ where (Н_ПЛАНЫ.ФО_ИД in 
 (Select Н_ФОРМЫ_ОБУЧЕНИЯ.ИД from Н_ФОРМЫ_ОБУЧЕНИЯ where Н_ФОРМЫ_ОБУЧЕНИЯ.ИМЯ_В_ИМИН_ПАДЕЖЕ = 'очная' or Н_ФОРМЫ_ОБУЧЕНИЯ.ИМЯ_В_ИМИН_ПАДЕЖЕ = 'заочная')) and
 Н_ПЛАНЫ.НАПС_ИД in    
(select Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД from Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ where Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД in 
    (select Н_НАПР_СПЕЦ.ИД from Н_НАПР_СПЕЦ where Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ::integer = 230101))))) and Н_УЧЕНИКИ.ПРИЗНАК='отчисл' and Н_УЧЕНИКИ.КОНЕЦ_ПО_ПРИКАЗУ='2012-09-01';

select ПРИЗНАК, СОСТОЯНИЕ from Н_УЧЕНИКИ where Н_УЧЕНИКИ.ПРИЗНАК = 'диплом';
select Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО from Н_ЛЮДИ where Н_ЛЮДИ.ИД not in(select Н_ОБУЧЕНИЯ.ЧЛВК_ИД from Н_ОБУЧЕНИЯ where Н_ОБУЧЕНИЯ.ЧЛВК_ИД in (select Н_УЧЕНИКИ.ЧЛВК_ИД from Н_УЧЕНИКИ and Н_УЧЕНИКИ.ПРИЗНАК = 'диплом'));